Tekla Open API Reference for Tekla Structures 2025
RebarSetAddition.Modify Method
 Modifies the rebar set addition in the model database to match the current one.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True if successful, otherwise false.
See Also
Reference
RebarSetAddition Class
Tekla.Structures.Model Namespace